module.exports = {
  name: "limon-auto-reply",
  event: "message",

  run: async (sock, m, from) => {
    try {
      if (!m.message) return;

      const text =
        m.message.conversation?.toLowerCase() ||
        m.message.extendedTextMessage?.text?.toLowerCase();

      if (!text) return;

      const sender = m.key.participant || m.key.remoteJid;

      // KEYWORDS
      const triggers = ["bot", "বট", "limon", "ai", "bot?", "হেই বট"];

      if (!triggers.some((w) => text.includes(w))) return;

      // YOUR REPLIES
      const replies = [
        `যদি 𝙆𝙖𝙧𝙊– সাথে খারাপ আচরণ করে থাকি তাহলে🙂  
✃𝙞 𝙇𝙤𝙫𝙀 𝙮𝙤𝙐🥺`,

        `হ্যাঁ 𝐒𝐨𝐧𝐚 বলো ❤️  
আমি তোমাকে বিয়ে করতে চাই 😉`,

        `আমি কি তুমার 𝐣𝐚𝐦𝐚𝐢 নাকি 😒  
আমাকে এত ডাকো কেনো হুম?`,

        `হ্যাঁ 𝐁𝐞𝐛𝐲 ❤️  
তোমাকে আমার সুজন বস অনেক ভালোবাসে!  
সুজনের পক্ষ থেকে — 𝐈 𝐋𝐨𝐯𝐞 𝐘𝐨𝐮 🤏🕶️`,

        `হ্যালো আমি লিমন 🤏😎  
আমাকে মারজান বস বানাইছে — আমার নাম লিমন বট!`,

        `🙄 চায়া থাকোস কেন?  
𝙆𝙞 কবি ক 🥴  
𝙏𝙪𝙞 কইলেই তো আমি কমূ হ 😐😂🥱`,

        `𝘼𝙢𝙞 পড়ে গেছি 𝙏𝙤𝙢𝙖𝙧 প্রেমে 𝘽𝙖𝙗𝙪 😘`,

        `___একটা মন দাও…  
ছিনি’মি’নি খে’লবো 🥺🐸`,

        `ইয়ে মানে একটা কথা কইতাম 🙂  
🇼hatsapp থেকে আপনাদের বাড়ি কত দূর? 😁`,

        `প্রেমে পড়ে গেলে পাশে থাকুন…  
মনে জায়গা নেই 😁`
      ];

      // RANDOM PICK
      const random = replies[Math.floor(Math.random() * replies.length)];

      await sock.sendMessage(from, {
        text: random,
        mentions: [sender],
      });

    } catch (err) {
      console.log("Auto Reply Error:", err);
    }
  },
};
